/*/////////////////////////////////////////////////////////////////////

	ІП-13 Пархомчук Ілля (Вікторович)
	Варіант 26

*//////////////////////////////////////////////////////////////////////

#include <iostream> 
#include <conio.h>


using std::cin;
using std::cout;


int main()
{
	setlocale(LC_ALL, ".1251");
	system("chcp 1251 > null");

	float x, y;

	cout << "Введіть координати точки: ";
	cin >> x >> y;

	/*/////////////////////////////////////////////////////////////////////

		для I четверті   (x > 0, y > 0) – умова -x + 2 < y
		для II четверті  (x < 0, y > 0) – умова x + 2 > y
		для III четверті (x < 0, y < 0) – умова -x - 2 > y
		для IV четверті  (x > 0, y < 0) – умова x - 2 < y

	*//////////////////////////////////////////////////////////////////////

	if (x * x + y * y < 4)
	{
		if (-x + 2 < y and x > 0 and y > 0)
			cout << "Точка належить області\n";
		else if (x + 2 > y and x < 0 and y > 0)
			cout << "Точка належить області\n";
		else if (-x - 2 > y and x < 0 and y < 0)
			cout << "Точка належить області\n";
		else if (x - 2 < y and x > 0 and y < 0)
			cout << "Точка належить області\n";
		else
			cout << ("Точка не належить області\n");
	}
	else
		cout << "Точка не належить колу\n";

	_getch();
	return 0;
}