/*/////////////////////////////////////////////////////////////////////

    ІП-13 Пархомчук Ілля (Вікторович)
    Варіант 26

***********************************************************************
    Трикутник заданий величинами своїх кутів і радіусом описаного кола.
    Знайти сторони трикутника.

*//////////////////////////////////////////////////////////////////////

#include <iostream> //підключення потрібних нам бібліотек
#include <conio.h>
#include <math.h>

using std::cin; //ці два рядки потрібні,
using std::cout;//бо використовувати "using namespace std" - моветон

#define PI 3.14159265358979323846 //чесно вкрав дефайн з біліотеки ))

int main()
{
    setlocale(LC_ALL, ".1251"); // ці два рядки потрібні, 
    system("chcp 1251 > null"); // щоб нормально відображалась українська буква "і"

    float side_a, side_b, side_c; //оголошення змінних сторін 

    float alpha, beta, gamma;// оголошення змінних кутів
    float radius;   // оголошення змінної радіуса 

    cout << "Введіть кути: ";
    cin >> alpha >> beta >> gamma; //ввід 3-х кутів по черзі

    cout << "Введіть радіус описаного кола: ";
    cin >> radius; //підписання пакту Молотова-Ріббентропа

    /******************************

          a       b       c
        ----- = ----- = ----- = 2 R
        sin(a)  sin(b)  sin(c)

        a = 2 R * sin(a);

    ******************************/

    side_a = 2 * radius * sin(alpha / 180 * PI); //обислення першої сторони за формулою вище
    side_b = 2 * radius * sin(beta / 180 * PI); //обислення другої сторони за формулою вище
    side_c = 2 * radius * sin(gamma / 180 * PI); //обислення третьої сторони за формулою вище

    printf("\nСторони:\n\ta = %.2f\n\tb = %.2f\n\tc = %.2f\n", //красивий вивід 3-х сторін
                                side_a, side_b, side_c);

    // printf() приймає аргументами рядок-формат та змінні, які будуть виведені за даним форматом
    // символ '\n' - перехід на новий рядок
    // символ '\t' - табуляція
    // "%f" - означає, що на місце цього в рядок буде вставлений переданий далі аргумент типу float
    // "%.2f" - означає, що вставлений аргумент типу float буде відображатися лише до 2-го знаку піся крапки
    _getch(); // моя улюблена функція. Тут - просто не дає вікну з програмою закритись до натиску клавіші
    return 0;
}